city_areas = {
        "fields": {
            "name": "🌾 Полевой округ",
            "professions": {
        "Агроном": {
            "description": "🌿 Агроном занимается земледелием и отвечает за все стадии производства: от посева сельхозкультур до\
хранения урожая. Благодаря работе этого специалиста на столе появляются свежие овощи и фрукты, крупы, грибы и другие продукты.",
            "what_makes": "1.Планирует, организует и участвует в полевых работах.\n"
                          "2.Анализирует и улучшает плодородие почвы.\n"
                          "3.Защищает растения от болезней, сорняков и вредителей.\n"
                          "4.Следит за эффективностью полевых работ.\n"
                          "5.Оценивает состояние окружающей среды.\n"
                          "6.Обучает агрономическим методам работников и фермеров.\n"
                          "7.Распределяет ресурсы — воду, удобрения и прочее.",
            "perspectives": "Спрос на агрономов будет только увеличиваться, а профессия — развиваться.  Уже сейчас эти \
специалисты использует в работе самые современные технологии, среди них: спутниковые системы, автопилотируемая техника, \
сельскохозяйственные дроны, умные метеостанции. Профессию агронома точно можно отнести к профессиям будущего. Особенно \
будут востребованы агрономы-генетики, которые занимаются генной модификацией растений.",
            "skills":"1.Глубокие знания в области агрономии, агрохимии, почвоведения и растениеводства.\n"
                      "2.Умение анализировать состояние почвы и растений, выбирать оптимальные сорта и гибриды с учетом климата и условий хозяйства.\n"
                      "3.Навыки работы с агротехническим оборудованием и приборами для изучения свойств почвы и растений.\n"
                      "4.Интерес к биологии и ботанике, желание работать на открытом воздухе и взаимодействовать с природой.\n"
                      "5.Cпособность к планированию и организации сельскохозяйственных процессов.",
            "where_study": "📍Рязанский государственный агротехнологический университет имени П.А. Костычева – РГАТУ\n"
                           "📍Российский государственный аграрный университет – МСХА им. К.А. Тимирязева \n"
                           "📍Московский государственный университет имени М.В. Ломоносова\n"
                           "📍Российский университет дружбы народов (РУДН)\n"
                           "📍Цивильский аграрно-технологический техникум\n"
                           "📍Чувашский государственный аграрный университет",
            "video": "https://youtu.be/kt4VoGL1Ng0?si=_ddlYquWQOAhJpb7"
        },
        "Агроэколог": {
            "description": "🌱 Агроэколог оценивает, как работа агропредприятий отражается на качестве почвы, воды, воздуха и \
биоразнообразия. Разрабатывает устойчивые и экологически безопасные методы производства и утилизации отходов.",
            "what_makes":"1.Анализирует воздействие агротехнологий на окружающую среду.\n"
                          "2.Разрабатывает методы утилизации отходов.\n"
                          "3.Предлагает решения по восстановлению экологии после сельхозработ.\n"
                          "4.Проводит мероприятия по сохранению и восстановлению местных экосистем и видов.",
            "perspectives":"Агроэкологи постоянно внедряют в свою работу новые технологии для сбора, анализа и управления\
экологическими данными. В будущем такие специалисты будут особенно востребованы, потому что агропредприятия все больше \
задумываются о рациональном и экологичном использовании ресурсов.",
            "skills": "1.Знания в области биологии, экологии, химии и сельского хозяйства.\n"
                      "2.Аналитический склад ума и системное мышление для оценки воздействия сельскохозяйственной \
деятельности на окружающую среду.\n"
                      "3.Коммуникабельность и умение объяснять экологические методы фермерам, бизнесу и чиновникам.\n"
                      "4.Готовность к полевой работе и мобильность.\n"
                      "5.Интерес к природоохранной деятельности и устойчивому развитию сельского хозяйства.",
            "where_study": "📍Московском государственном университете им. М.В. Ломоносова\n"
                           "📍Российский университет дружбы народов (РУДН)\n"
                           "📍Российский государственный аграрный университет – МСХА имени К. А. Тимирязева\n"
                           "📍Омский государственный аграрный университет им. П.А. Столыпина",
            "video": "https://rutube.ru/video/f3eb61caa95f7b773c083030f877dbdc/?r=wd"
        },
        "Сити-фермер": {
            "description": "🏙️ Сити-фермер Выращивает сельхозкультуры в городских условиях, например, зелень, грибы, \
овощи, ягоды. Часто посадки расположены на многоярусных стеллажах с подсветкой. В таких вертикальных фермах вместо почвы\
используют питательные субстраты, например, воду с микроэлементами.",
            "what_makes": "1.Выбирает подходящие для города растения.\n"
                          "2.Выращивает сельхозкультуры на продажу.\n"
                          "3.Использует беспочвенные технологии.\n"
                          "4.Разбирается в строении и жизненном цикле растений.\n"
                          "5.Часто самостоятельно ведёт бизнес.",
            "perspectives": "Появляется всё больше технологий, которые позволяют выращивать сельхозкультуры внутри зданий,\
на крышах, в подвальных помещениях. Получать урожай можно быстро и с небольшими затратами на транспорт. С учётом роста \
населения, особенно городского, такие возможности уникальны. В России уже есть несколько компаний, которые профессионально \
занимаются сельским хозяйством в условиях города. С каждым годом востребованность сити-фермеров будет расти, поэтому эту \
специальность точно можно отнести к профессиям будущего.",
            "skills": "1.Знания в области агрономии, биологии, экологии, инженерии и архитектуры.\n"
                      "2.Умение планировать посевы, уход за растениями, полив и уборку урожая в условиях ограниченного пространства.\n"
                      "3.Навыки работы с современными технологиями, включая автоматизированные системы полива и освещения.\n"
                      "4.Творческий подход к озеленению мегаполисов и рациональному использованию городского пространства.\n"
                      "5.Интерес к предпринимательству и устойчивому городскому сельскому хозяйству.",
            "where_study": "📍РГАУ-МСХА им. К.А. Тимирязева\n"
                           "📍Государственный аграрный университет Северного Зауралья \n"
                           "📍Новосибирский государственный аграрный университет \n"
                           "📍Институт фундаментальных и прикладных агробиотехнологий им. И. В. Мичурина",
            "video": "https://youtu.be/lA1TgbsCQzw?si=lXS68uWKkqoysJwS"
                }
            }
        },

    "lab": {
        "name": "🔬 Лабораторный квартал",
        "professions": {
            "Биотехнолог": {
                        "description": "🔬 Биотехнолог. Создает новые сорта растений и породы сельскохозяйственных животных \
с улучшенными свойствами. Выделяет клетки из организма и переносит их на искусственные питательные среды, где они \
продолжают жить и размножаться. Для биотехнолога важно не только придумать новую технологию, но и масштабировать её.",
                        "what_makes": "1.Разрабатывает новые составы продуктов.\n"
                                      "2.Внедряет новые технологии на предприятии.\n"
                                      "3.Совершенствует производственные процессы.\n"
                                      "4.Участвует в выборе оборудования, материалов и сырья.\n"
                                      "5.Применяет научные методы генной инженерии.",
                        "perspectives": "Биотехнологи делают жизнь человека лучше. Помогают странам развиваться экономически\
и социально. Эти специалисты выводят устойчивые сорта растений и породы животных, не подверженные неблагоприятным условиям,\
вредителям и болезням. Биотехнологии создают новые продукты с полезными свойствами на основе различных органических материалов.\
В будущем новые технологии помогут в решении проблем экологии и нехватки пищевых ресурсов.",
                        "skills": "1.Глубокие знания в области биологии, микробиологии, химии и генетики.\n"
                                  "2.Умение работать с лабораторным оборудованием и проводить эксперименты.\n"
                                  "3.Навыки анализа данных и обработки экспериментальных результатов.\n"
                                  "4.Интерес к научным исследованиям и разработке новых биотехнологических продуктов.\n"
                                  "5.Ответственность, аккуратность и внимание к деталям.",
                        "where_study": "📍Московский государственный технический университет имени Н.Э. Баумана\n"
                                       "📍Московский государственный университет технологий и управления им. К.Г. Разумовского\n"
                                       "📍Санкт-Петербургский государственный аграрный университет\n"
                                       "📍Новосибирский национальный исследовательский государственный университет",
                        "video": "https://youtu.be/uMQe6OqtaHI?si=6I7f6ZgD1boyAO8t"
            },
            "Селекционер": {
                        "description": "🌾 Селекционер улучшает полезные генетические свойства и подавить нежелательные. \
    Увеличивает урожайность и стойкость растений к болезням и улучшает адаптацию животных к различны условиям среды. Добивается \
    своих целей благодаря методами отбора и скрещивания организмов.",
                        "what_makes": "1.Отбирает генетические материалы.\n"
                                      "2.Планирует и проводит скрещивание.\n"
                                      "3.Использует биотехнологии и молекулярные методы.\n"
                                      "4.Анализирует данные.\n"
                                      "5.Улучшает и разрабатывает новые сорта растений и породы животных.",
                        "perspectives": "Сейчас эта профессия считается одной из самых востребованных в АПК. \
Успешная и разноплановая селекционная работа – залог успешного развития всего сельского хозяйства.",
                        "skills": "1.Глубокие знания в области биологии, микробиологии, химии и генетики.\n"
                                  "2.Умение работать с лабораторным оборудованием и проводить эксперименты.\n"
                                  "3.Навыки анализа данных и обработки экспериментальных результатов.\n"
                                  "4.Интерес к научным исследованиям и разработке новых биотехнологических продуктов.\n"
                                  "5.Ответственность, аккуратность и внимание к деталям.",
                        "where_study": "📍Удмуртский государственный аграрный университет\n"
                                       "📍Московская государственная академия ветеринарной медицины и биотехнологии – МВА имени К.И. Скрябина\n"
                                       "📍Российский университет дружбы народов имени Патриса Лумумбы\n"
                                       "📍Российский государственный аграрный университет - МСХА имени К.А. Тимирязева"

            },
            "Агрогенетик": {
                        "description": "🧬 Агрогенетик применяющий генетические и биотехнологические методы для улучшения \
    сельскохозяйственных культур и животных. Он работает на стыке агрономии, молекулярной биологии и биоинформатики, \
    создавая организмы с заданными свойствами.",
                        "what_makes": "1.Изучает геномы растений и животных для выявления полезных генов.\n"
                                      "2.Применяет методы генной инженерии и редактирования генома для создания новых сортов и пород.\n"
                                      "3.Разрабатывает и внедряет молекулярные маркеры для ускорения селекционного процесса.\n"
                                      "4.Сотрудничает с селекционерами и биотехнологами для внедрения инноваций в сельское хозяйство.\n"
                                      "5.Проводит анализ данных и моделирование генетических процессов.",
                        "perspectives": "С развитием биотехнологий и генной инженерии агрогенетики становятся \
всё более востребованными. Их работа позволяет создавать устойчивые к болезням и климатическим \
изменениям сельскохозяйственные культуры, что особенно важно для обеспечения продовольственной безопасности.",
                        "skills": "1.Глубокие знания в области генетики, молекулярной биологии и биоинформатики.\n"
                                  "2.Умение работать с лабораторным оборудованием и специализированным программным обеспечением."
                                  "3.Интерес к научным исследованиям и инновационным технологиям.\n"
                                  "4.Способность к аналитическому мышлению и внимательность к деталям.\n",
                        "where_study": "📍Российский государственный аграрный университет – МСХА им. К. А. Тимирязева.\n"
                                       "📍Кубанский государственный аграрный университет.\n"
                                       "📍Саратовский государственный университет генетики, биотехнологии и инженерии имени Н. И. Вавилова.\n"
                                       "📍Российский университет дружбы народов (РУДН), факультет агро- и биотехнологий. "
                        }
                    }
                },
    "vet": {
            "name": "🐾 Звериная улица",
            "professions": {
                "Ветеринар": {
                    "description": "🐶 Ветеринар занимающийся диагностикой, лечением и профилактикой заболеваний у животных.\
Он обеспечивает здоровье домашних и сельскохозяйственных животных, а также контролирует безопасность продуктов животного происхождения.",
                    "what_makes": "1.Проводит осмотры, диагностику и лечение животных.\n"
                                  "2.Выполняет хирургические операции и другие медицинские процедуры.\n"
                                  "3.Проводит вакцинацию и профилактические мероприятия.\n"
                                  "4.Консультирует владельцев животных по вопросам ухода и содержания.\n"
                                  "5.Участвует в ветеринарно-санитарной экспертизе продуктов животного происхождения.",
                    "perspectives": "Ветеринары востребованы в клиниках, на фермах, в зоопарках,\
лабораториях и государственных учреждениях. С ростом числа домашних животных и повышением требований к качеству продуктов \
животного происхождения спрос на квалифицированных ветеринаров продолжает расти. ",
                    "skills": "1.Глубокие знания в области анатомии, физиологии и патологии животных.\n"
                              "2.Умение проводить диагностику и назначать эффективное лечение.\n"
                              "3.Навыки проведения хирургических вмешательств и оказания экстренной помощи.\n"
                              "4.Интерес к медицине и желание помогать животным.\n"
                              "5.Стрессоустойчивость, внимательность и аккуратность.",
                    "where_study": "📍Московская государственная академия ветеринарной медицины и биотехнологии им. К. И. Скрябина.\n"
                                   "📍Санкт-Петербургская государственная академия ветеринарной медицины.\n"
                                   "📍Казанская государственная академия ветеринарной медицины\n"
                                   "📍Чувашский государственный аграрный университет"
                              },
                "Зоотехник": {
                    "description": "🐄 Зоотехник занимается организацией и управлением процессов разведения, кормления и\
содержания сельскохозяйственных животных. Его цель — повышение продуктивности и качества продукции животноводства.",
                    "what_makes": "1.Следит за здоровье животных и условиями их содержания\n"
                                  "2.Контролирует продукцию животноводства (санитарные нормы, стандарты качества)\n"
                                  "3.Отбирает особей для размножения \n"
                                  "4.Составляет график выгула и выпаса\n"
                                  "5.Руководит сотрудниками, которые ухаживают за животными",
                    "perspectives": "Зоотехники востребованы в сельскохозяйственных предприятиях,\
фермерских хозяйствах и научно-исследовательских институтах. С развитием технологий и увеличением потребности в качественной \
продукции животноводства роль зоотехника становится всё более значимой. ",
                    "skills": "1.Глубокие знания в области зоотехнии, биологии и физиологии животных.\n"
                              "2.Умение анализировать данные и принимать обоснованные решения.\n"
                              "3.Навыки планирования и организации производственных процессов.\n"
                              "4.Интерес к работе с животными и стремление к повышению эффективности производства.\n"
                              "5.Ответственность, наблюдательность и коммуникабельность.",
                    "where_study": "📍Российский государственный аграрный университет – МСХА им. К. А. Тимирязева.\n"
                                   "📍Санкт-Петербургский государственный аграрный университет.\n"
                                   "📍Кубанский государственный аграрный университет."
                },

                "Животновод": {
                    "description": "📊 Животновод занимается уходом, кормлением и разведением сельскохозяйственных животных.\
Он обеспечивает их здоровье и комфорт, что напрямую влияет на продуктивность хозяйства. Контролирует кормление и содержание животных",
                    "what_makes": "1.Кормит и пасет животных\n"
                                  "2.Собирает продукты животноводства \n"
                                  "3.Вакцинирует животных, производит забор анализов\n"
                                  "4.Клеймит и маркирует животных\n"
                                  "5.Чистит помещения для содержания животных\n"
                                  "6.Ведет служебную документацию",
                    "perspectives": "Животноводы востребованы на фермах, в племенных хозяйствах и \
аграрных предприятиях. С развитием технологий и увеличением масштабов производства роль квалифицированных животноводов становится всё более значимой. ",
                    "skills": "1.Знания в области зоологии, анатомии и физиологии животных.\n"
                              "2.Умение распознавать признаки заболеваний и оказывать первую помощь\n"
                              "3.Навыки ухода за животными и соблюдения санитарных норм.\n"
                              "4.Физическая выносливость, терпение и ответственность.\n"
                              "5.Интерес к сельскому хозяйству и работе с животными.",
                    "where_study": "📍Российский государственный аграрный университет – МСХА им. К. А. Тимирязева.\n"
                                   "📍Санкт-Петербургский государственный аграрный университет.\n"
                                   "📍Волгоградский государственный аграрный университет\n"
                                   "📍Московская государственная академия ветеринарной медицины и биотехнологии – МВА имени К.И. Скрябина"
                    }
                }
            },

    "tech": {
            "name": "🤖 Технорайон",
            "professions": {
                "Оператор дронов": {
                    "description": "🚁 На многих агропредприятиях используются дроны. Беспилотники помогают следить за \
полями. Например, анализировать состояние почвы и посевов, распылять удобрения и пестициды. Управляют сельхоздронами \
(БПЛА) — операторы. Именно они составляют план полета и обрабатывают собранную информацию",
                    "what_makes": "1.Готовит дрон к полету и управляет им\n"
                                  "2.Присоединяет к БПЛА дополнительную технику\n"
                                  "3.Обслуживает и ремонтирует дроны\n"
                                  "4.Составляет план полета\n"
                                  "5.Анализирует и обрабатывает данные\n"
                                  "6.Принимает решения в кризисных ситуациях",
                    "perspectives": "Дроны — техника, революционная для сельского хозяйства. Беспилотники упрощают множество\
задач. Но для управления дронами нужны профессиональные операторы. Без этих специалистов грамотно подготовиться к полету,\
спланировать его и реализовать просто невозможно. Эту профессию точно можно отнести к профессиям будущего.",
                    "skills": "1.Управление беспилотными летательными аппаратами (БПЛА)\n"
                              "2.Планирование и проведение полетных заданий\n"
                              "3.Техническое обслуживание и настройка дронов\n"
                              "4.Сбор, обработка и анализ данных с помощью специализированного ПО\n"
                              "5.Интерес к авиации, технологиям точного земледелия и IT",
                    "where_study": "📍Белгородский государственный аграрный университет имени В.Я. Горина\n"
                                   "📍Волгоградский государственный аграрный университет\n"
                                   "📍Московский авиационный институт\n"
                                   "📍Донской государственный технический университет"
                },
                "Агроинженер": {
                    "description": "🛠️ Агроинженер объединяет сельское хозяйство с передовыми технологиями. Его ключевая задача — увеличить\
урожай при минимальных затратах. Агроинженер разрабатывает новое оборудование и системы для агроотрасли. Обслуживает и \
ремонтирует сельскохозяйственную технику.",
                    "what_makes": "1.Работает с сельскохозяйственным оборудованием\n"
                                  "2.Проводит испытания и определяет эффективность агротехники\n"
                                  "3.Контролирует ремонтные работы\n"
                                  "4.Заключает договоры с поставщиками сельхозтехники\n"
                                  "5.Координирует деятельность всех сотрудников сельскохозяйственного предприятия\n"
                                  "6.Обучает новых работников методам и правилам работы с техникой",
                    "perspectives": "Агроинженер с каждым годом становится всё более востребованным специалистом. Только\
они способны создать сельхозтехнику, которая будет работать в разы эффективнее и при этом не \
портить экологию. Это важно для решения продовольственного вопроса — нехватки пищевых ресурсов. Ключевой задачей для \
агроинженеров будущего станет бесперебойная работа техники и её усовершенствование. Таким образом, удастся повысить \
урожайность и при этом снизить нагрузку на биосферу. ",
                    "skills": "1.Техническое мышление и способность анализировать сложные системы.\n"
                              "2.Умение читать и создавать инженерно-техническую документацию.\n"
                              "3.Навыки проектирования с использованием CAD-программ.\n"
                              "4.Понимание принципов работы сельскохозяйственного оборудования.\n"
                              "5.Знание основ агрономии и животноводства.\n"
                              "6.Способность работать с системами автоматизации и контроля.\n"
                              "7.Навыки анализа данных и оптимизации процессов.\n"
                              "Также важно обладать такими личностными качествами, как внимательность, ответственность, \
                              инициативность и умение работать в команде.",
                    "where_study": "📍Чувашский государственный аграрный университет\n"
                                   "📍Балтийский федеральный университет имени Иммануила Канта\n"
                                   "📍Российский государственный аграрный университет - МСХА имени К.А. Тимирязева \n"
                                   "📍Санкт-Петербургский государственный аграрный университет\n"
                                   "📍Уральский государственный аграрный университет "
                    },
                "Робототехник": {
                    "description": "🤖 Робототехник разрабатывает, проектирует, конструирует, тестирует и обслуживает \
роботов и роботизированные системы. Это включает в себя выбор компонентов, разработку программного обеспечения, настройку \
и отладку, а также обеспечение бесперебойной работы уже созданных роботов.",
                    "what_makes": "1.Проектирует роботов и автоматические системы под запросы заказчиков\n"
                                  "2.Cоздает ПО\n"
                                  "3.Продумывает элементы управления робототехническими системами: компьютерное зрение, обработку речи и интерфейсы\n"
                                  "4.Моделирует и подбирает материалы для изготовления роботов\n"
                                  "5.Тестирует роботов и исправляет баги\n"
                                  "6.Обучает персонал использовать роботов",
                    "perspectives": "Профессия специалиста по робототехнике и мехатронике является одной из самых перспективных\
в инженерной сфере. Спрос на таких специалистов растет в различных отраслях, включая промышленность, медицину, сельское хозяйство и IT.",
                    "skills": "1.Интерес к точным наукам и инженерному делу\n"
                              "2.Аналитический склад ума и развитое логическое мышление\n"
                              "3.Знания в области механики, электроники и программирования\n"
                              "4.Умение читать схемы и чертежи\n"
                              "5.Навыки проектирования и создания программного обеспечения\n"
                              "6.Способность к диагностике и устранению технических неисправностей\n"
                              "7.Готовность к постоянному обучению и освоению новых технологий",
                    "where_study": "📍Московский государственный технический университет имени Н. Э. Баумана\n"
                                   "📍Национальный исследовательский университет «МЭИ»\n"
                                   "📍Университет Иннополис\n"
                                   "📍Казанский национальный исследовательский технический университет им. А.Н. Туполева\n"
                                   "📍Дальневосточный федеральный университет (ДВФУ)"
                }
            }
        }
    }




